<a href="https://colab.research.google.com/github/hsay95/DIY-Data-Science/blob/master/Pandas_SQLite.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Learning Links:**
1. Python - https://www.tutorialspoint.com/python/index.htm
2. Pandas - https://www.tutorialspoint.com/python_pandas/index.htm
3. SQL practice - https://sqlzoo.net/
4. SQL Theory - https://www.w3schools.com/sql/

#**Python - Crash Course**

##### **Variables** - containers that hold information

In [0]:
# Variable that holds first and last name

first_name = "Chandler"
last_name = "Bing"
multiple_words = "one apple two grapes"


total_deaths_in_GameOfThrones = 5863  # source: https://www.statista.com/statistics/420077/game-of-thrones-deadliest-seasons/ 


print(first_name)

print(total_deaths_in_GameOfThrones)

Chandler
5863

In [0]:
print("Last name of a funny guy: "+ last_name)

Last name of a funny guy: Bing

You can perform arthmetic operations  as well

In [0]:
a = 10
b = 9
c_add = a + b
print(c_add)

19

##### **Variable Data Types**

In [0]:
#Integer
print(total_deaths_in_GameOfThrones)

5863

In [0]:
#Float
pi = 3.14
print(pi)

3.14

In [0]:
# Boolean - True or False
bool_value = True
print(bool_value)
print()
print(10==100) #False
print('True'=='False') #False
print(99 > 89.99999999) # True

True

False
False
True

In [0]:
#String - basicall text 
rock_anthem = "we will rock you!"
print(rock_anthem)

we will rock you!

##### **Array or List variables**
![alt text](https://www2.hawaii.edu/~walbritt/ics212/materials/arrays_h1_381x122.gif)

In [0]:
# Array - Data Structure; containers with different slots which can store different type of data 

array_name = ['Orange','Smith','Raj']
print(array_name)
print()

no_theme = [3.14, "answer to the universe", 42]
print(no_theme)

['Orange', 'Smith', 'Raj']

[3.14, 'answer to the universe', 42]

In [0]:
no_theme[1]

'answer to the universe'

In [0]:
no_theme[4]

IndexError: ignored

In [0]:
# To append elements to your list
no_theme.append("university")

print(no_theme)

[3.14, 'answer to the universe', 42, 'university']

In [0]:
# List length using len()
len(no_theme)

4

In [0]:
# Change the element in the list
no_theme[3] = "NEU"

print(no_theme)

[3.14, 'answer to the universe', 42, 'NEU']

In [0]:
# Slicing lists is a technique used to get elements from, before or between different indices

print("All elements: ", no_theme[:])
print()

print("All elements from the 3rd position onward: ", no_theme[2:])
print()

print("All elements between the 2nd and 4th position: ", no_theme[1:3])
print()

print("All elements before the last postion", no_theme[:-1])

# Very useful guide:

#a[start:stop]  # items start through stop-1
#a[start:]      # items start through the rest of the array
#a[:stop]       # items from the beginning through stop-1
#a[:]           # a copy of the whole array

All elements:  [3.14, 'answer to the universe', 42, 'university']

All elements from the 3rd position onward:  [42, 'university']

All elements between the 2nd and 4th position:  ['answer to the universe', 42]

All elements before the last postion [3.14, 'answer to the universe', 42]

##### **Dictionary** - python objects which store information in key:value pairs
![alt text](https://developers.google.com/edu/python/images/dict.png)

In [0]:
country_info = {"Japan": "Tokyo",
                "Germany": "Berlin"}

print(country_info)
print()

print(country_info["Germany"])

{'Japan': 'Tokyo', 'Germany': 'Berlin'}

Berlin

In [0]:
country_info["Seven Kingdoms"] =  "King's Landing"

print(country_info)

{'Japan': 'Tokyo', 'Germany': 'Berlin', 'Seven Kingdoms': "King's Landing"}

In [0]:
country_info.keys()

dict_keys(['Japan', 'Germany', 'Seven Kingdoms'])

##### **Conditional Statements - If and Else**

In [0]:
x = 4
if(x>5):
  print(str(x) + " is greater than 5")
else:
  print(str(x) + " is smaller than 5")

4 is smaller than 5

In [0]:
x = 29

if x < 10:
    print("less than 10")
elif x > 10 and x <= 19:
    print("greater than zero but less than 10")
else:
    print("over 20")

over 20

##### **Loops**

In [0]:
# For loops for iteration
for i in range(0,10):
  print(i)

0
1
2
3
4
5
6
7
8
9

In [0]:
# Loop to iterate through a list
list_theme = ['apple','phones','money','extremely overpriced monitor stand']

for x in list_theme:
  print(x)

apple
phones
money
extremely overpriced monitor stand

In [0]:
# While loops

x = 0
while x < 5:
    x += 1
    print(x)

1
2
3
4
5

##### **Functions - reusable code modules**

In [0]:
def pizza_area(radius):
  area = 3.14 * (radius**2)
  return area

In [0]:
# Small pizza - 12 inches
pizza_area(12)

452.16

In [0]:
# Medium pizza - 14 inches
pizza_area(14)

615.44

In [0]:
# Large pizza - 16 inches
pizza_area(16)

803.84

In [0]:
def pizza_area_per_person(radius, no_of_person):
  area = 3.14 * radius * radius
  per_person = area/no_of_person

  if(radius <= 12):
    print("Small Pizza")
    print("Area: " + str(round(area,2)))
    print("Each person gets: " + str(round(per_person,2)))
    print()
  
  elif(radius > 12 and radius <=14 ):
    print("Medium Pizza")
    print("Area: " + str(round(area,2)))
    print("Each person gets: " + str(round(per_person,2)))
    print()
  
  else:
    print("Large Pizza")
    print("Area: " + str(round(area,2)))
    print("Each person gets: " + str(round(per_person,2)))
    print()

In [0]:
# Standard pizza sizes shared amongst 4 people 
pizza_area_per_person(12,4)
pizza_area_per_person(14,4)
pizza_area_per_person(16,4)

Small Pizza
Area: 452.16
Each person gets: 113.04

Medium Pizza
Area: 615.44
Each person gets: 153.86

Large Pizza
Area: 803.84
Each person gets: 200.96

#**Pandas - Python Data Analysis Library  - Overview**

Prior to Pandas, Python was majorly used for data munging and preparation. It had very little contribution towards data analysis. Pandas solved this problem. Using Pandas, we can accomplish five typical steps in the processing and analysis of data, regardless of the origin of data â€” load, prepare, manipulate, model, and analyze.

Python with Pandas is used in a wide range of fields including academic and commercial domains including finance, economics, Statistics, analytics, etc

Key Features of Pandas
1. Fast and efficient DataFrame object with default and customized indexing.
2. Tools for loading data into in-memory data objects from different file formats.
3. Data alignment and integrated handling of missing data.
4. Reshaping and pivoting of date sets.
5. Label-based slicing, indexing and subsetting of large data sets.
6. Columns from a data structure can be deleted or inserted.
7. Group by data for aggregation and transformations.
8. High performance merging and joining of data.
9. Time Series functionality.

### Data Structures in Pandas
1. Series - 1D array like structure with homogenous data.
2. Dataframe - 2D structure made of multiple series; heterogenuous data; Most common
3. Panel - 3D structure serves a container of dataframes

##### Pandas Series

In [0]:
#Importin pandas package and renaming it as 'pd'
import pandas as pd

In [0]:
# Python list
a = [1, 5, 621, 6513, 616, 727, 723, 725,99,22,22,99,22]
print(type(a))
print()
print(a)

<class 'list'>

[1, 5, 621, 6513, 616, 727, 723, 725, 99, 22, 22, 99, 22]

In [0]:
# Convert it to Pandas series
a = pd.Series(a)
print(a)

0        1
1        5
2      621
3     6513
4      616
5      727
6      723
7      725
8       99
9       22
10      22
11      99
12      22
dtype: int64

In [0]:
print(type(a))

<class 'pandas.core.series.Series'>

In [0]:
# Series Operation
print(a.max())
print('\n') # new line 

print(a.min())
print()

print(a.sort_values(ascending=True))

6513


1

0        1
1        5
9       22
10      22
12      22
8       99
11      99
4      616
2      621
6      723
7      725
5      727
3     6513
dtype: int64

In [0]:
a.value_counts()

22      3
99      2
621     1
725     1
6513    1
727     1
5       1
723     1
616     1
1       1
dtype: int64

In [0]:
word_series = pd.Series(['as','fa','ase','AA','aa','aa'])

In [0]:
print(word_series.max())
print()

print(word_series.min())
print()

print(word_series.value_counts()) # Case sensitive

fa

AA

aa     2
as     1
ase    1
fa     1
AA     1
dtype: int64

##### Dataframes

In [0]:
# Load csv dataset from github source
data_file = 'https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/titanic.csv'

df = pd.read_csv(data_file)

In [0]:
df.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

In [0]:
type(df)

pandas.core.frame.DataFrame

In [0]:
list_a = ['Corona Virus','puppies','toddlers','climate change']
list_b = [9,-2,8,999]

In [0]:
temp = pd.DataFrame(list_a)

In [0]:
temp

                0
0    Corona Virus
1         puppies
2        toddlers
3  climate change

In [0]:
import pandas as pd
temp = pd.DataFrame({
    'Entity':['13','33'],
    'Threat Level':['apple','']
})

temp

  Entity Threat Level
0     13        apple
1     33

In [0]:
temp = pd.DataFrame({
    'Entity':list_a,
    'Threat Level':list_b
})

In [0]:
temp

           Entity  Threat Level
0    Corona Virus             9
1         puppies            -2
2        toddlers             8
3  climate change           999

##### Dataframe - basics

In [0]:
# First 10 rows
df.head(10)

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0
5       1                              Anderson, Mr. Harry  ...        S         1
6       1                Andrews, Miss. Kornelia Theodosia  ...        S         1
7       1                           Andrews, Mr. Thomas Jr  ...        S         0
8       1    Appleton, Mrs. Edward Dale (Charlotte Lamson)  ...        S         1
9       1                          Artagaveytia, Mr. Ramon  ...        C         0

[10 rows x 11 columns]

In [0]:
# last 10 rows
df.tail(10)

      pclass                                     name  ... embarked  survived
1299       3                      Yasbeck, Mr. Antoni  ...        C         0
1300       3  Yasbeck, Mrs. Antoni (Selini Alexander)  ...        C         1
1301       3                     Youseff, Mr. Gerious  ...        C         0
1302       3                        Yousif, Mr. Wazli  ...        C         0
1303       3                    Yousseff, Mr. Gerious  ...        C         0
1304       3                     Zabour, Miss. Hileni  ...        C         0
1305       3                    Zabour, Miss. Thamine  ...        C         0
1306       3                Zakarian, Mr. Mapriededer  ...        C         0
1307       3                      Zakarian, Mr. Ortin  ...        C         0
1308       3                       Zimmerman, Mr. Leo  ...        S         0

[10 rows x 11 columns]

In [0]:
# Datatypes of columns
df.dtypes

pclass        int64
name         object
sex          object
age         float64
sibsp         int64
parch         int64
ticket       object
fare        float64
cabin        object
embarked     object
survived      int64
dtype: object

In [0]:
# basic stats of columns which has only numerical data
df.describe()

            pclass          age  ...         fare     survived
count  1309.000000  1046.000000  ...  1308.000000  1309.000000
mean      2.294882    29.881135  ...    33.295479     0.381971
std       0.837836    14.413500  ...    51.758668     0.486055
min       1.000000     0.166700  ...     0.000000     0.000000
25%       2.000000    21.000000  ...     7.895800     0.000000
50%       3.000000    28.000000  ...    14.454200     0.000000
75%       3.000000    39.000000  ...    31.275000     1.000000
max       3.000000    80.000000  ...   512.329200     1.000000

[8 rows x 6 columns]

##### Dataframe - selecting data

In [0]:
# Selecting one column; use square brackets [] for selection 
print(df['name'].head(10))

0                      Allen, Miss. Elisabeth Walton
1                     Allison, Master. Hudson Trevor
2                       Allison, Miss. Helen Loraine
3               Allison, Mr. Hudson Joshua Creighton
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
5                                Anderson, Mr. Harry
6                  Andrews, Miss. Kornelia Theodosia
7                             Andrews, Mr. Thomas Jr
8      Appleton, Mrs. Edward Dale (Charlotte Lamson)
9                            Artagaveytia, Mr. Ramon
Name: name, dtype: object

In [0]:
# To select data from specific row and column

# Syntax: df.loc[row_label, column_label]

df.loc[5 , "name"]

'Anderson, Mr. Harry'

In [0]:
# Selecting entire column
df.loc[: ,"name"]

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

In [0]:
# Selecting a row
df.loc[2, :]

pclass                                 1
name        Allison, Miss. Helen Loraine
sex                               female
age                                    2
sibsp                                  1
parch                                  2
ticket                            113781
fare                              151.55
cabin                            C22 C26
embarked                               S
survived                               0
Name: 2, dtype: object

In [0]:
# Selecting multiple columns

df.loc[2:4, ["name",'age','pclass','fare']]

                                              name   age  pclass    fare
2                     Allison, Miss. Helen Loraine   2.0       1  151.55
3             Allison, Mr. Hudson Joshua Creighton  30.0       1  151.55
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.0       1  151.55

In [0]:
# Selecting all columns
df.loc[2:4, :]

   pclass                                             name  ... embarked  survived
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[3 rows x 11 columns]

In [0]:
# selecting specific rows - pass a list of row numbers
df.loc[[1,3,5], :]

   pclass                                  name  ... embarked  survived
1       1        Allison, Master. Hudson Trevor  ...        S         1
3       1  Allison, Mr. Hudson Joshua Creighton  ...        S         0
5       1                   Anderson, Mr. Harry  ...        S         1

[3 rows x 11 columns]

In [0]:
df.isnull().head(10)

   pclass   name    sex    age  sibsp  ...  ticket   fare  cabin  embarked  survived
0   False  False  False  False  False  ...   False  False  False     False     False
1   False  False  False  False  False  ...   False  False  False     False     False
2   False  False  False  False  False  ...   False  False  False     False     False
3   False  False  False  False  False  ...   False  False  False     False     False
4   False  False  False  False  False  ...   False  False  False     False     False
5   False  False  False  False  False  ...   False  False  False     False     False
6   False  False  False  False  False  ...   False  False  False     False     False
7   False  False  False  False  False  ...   False  False  False     False     False
8   False  False  False  False  False  ...   False  False  False     False     False
9   False  False  False  False  False  ...   False  False   True     False     False

[10 rows x 11 columns]

In [0]:
df.head(10)

# Nan - not a number

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0
5       1                              Anderson, Mr. Harry  ...        S         1
6       1                Andrews, Miss. Kornelia Theodosia  ...        S         1
7       1                           Andrews, Mr. Thomas Jr  ...        S         0
8       1    Appleton, Mrs. Edward Dale (Charlotte Lamson)  ...        S         1
9       1                          Artagaveytia, Mr. Ramon  ...        C         0

[10 rows x 11 columns]

In [0]:
# Finding count of null values 
df.isnull().sum()

# As a rule of thumb a column contains more than 90% missing data it is better to remove that column from your analysis

pclass         0
name           0
sex            0
age          263
sibsp          0
parch          0
ticket         0
fare           1
cabin       1014
embarked       2
survived       0
dtype: int64

In [0]:
# View null values in a column
df['cabin'].isnull().head(15)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9      True
10    False
11    False
12    False
13     True
14    False
Name: cabin, dtype: bool

In [0]:
# Find rows where 'cabin' has Null values
df[df['cabin'].isnull()].head(15)

    pclass  ... survived
9        1  ...        0
13       1  ...        1
15       1  ...        0
23       1  ...        1
25       1  ...        0
35       1  ...        1
37       1  ...        1
40       1  ...        0
46       1  ...        0
48       1  ...        1
52       1  ...        0
53       1  ...        0
58       1  ...        0
59       1  ...        1
70       1  ...        0

[15 rows x 11 columns]

In [0]:
# Conditional selection
# Select passengers which are over 75
over_75 = df['age'] > 75

df[over_75]

    pclass  ... survived
14       1  ...        1
61       1  ...        1

[2 rows x 11 columns]

In [0]:
#Select passsengers who are female and 10 or under in age
df_female_10 = (df['sex'] == 'female') & (df['age'] <= 10)


#NOTE:
# a & b (pandas) = a and b (python)
# a | b (pandas) = a or b (python)

In [0]:
df[df_female_10]

      pclass                                      name  ... embarked  survived
2          1              Allison, Miss. Helen Loraine  ...        S         0
340        2               Becker, Miss. Marion Louise  ...        S         1
377        2          Collyer, Miss. Marjorie "Lottie"  ...        S         1
430        2         Harper, Miss. Annie Jessie "Nina"  ...        S         1
434        2                    Hart, Miss. Eva Miriam  ...        S         1
478        2                     Laroche, Miss. Louise  ...        C         1
479        2  Laroche, Miss. Simonne Marie Anne Andree  ...        C         1
540        2                  Quick, Miss. Phyllis May  ...        S         1
541        2                Quick, Miss. Winifred Vera  ...        S         1
588        2                         Wells, Miss. Joan  ...        S         1
590        2                     West, Miss. Barbara J  ...        S         1
591        2              West, Miss. Constance Mirium  ...        S         1
623        3        Andersson, Miss. Ebba Iris Alfrida  ...        S         0
624        3         Andersson, Miss. Ellis Anna Maria  ...        S         0
627        3      Andersson, Miss. Ingeborg Constanzia  ...        S         0
643        3            Asplund, Miss. Lillian Gertrud  ...        S         1
657        3                    Baclini, Miss. Eugenie  ...        C         1
658        3             Baclini, Miss. Helene Barbara  ...        C         1
659        3            Baclini, Miss. Marie Catherine  ...        C         1
679        3                   Boulos, Miss. Nourelain  ...        C         0
763        3   Dean, Miss. Elizabeth Gladys "Millvina"  ...        S         1
794        3             Emanuel, Miss. Virginia Ethel  ...        S         1
807        3          Ford, Miss. Robina Maggie "Ruby"  ...        S         0
828        3               Goodwin, Miss. Jessie Allis  ...        S         0
866        3                  Hirvonen, Miss. Hildur E  ...        S         1
895        3              Johnson, Miss. Eleanor Ileen  ...        S         1
916        3                        Karun, Miss. Manca  ...        C         1
934        3       Kink-Heilmann, Miss. Luise Gretchen  ...        S         1
937        3              Klasen, Miss. Gertrud Emilia  ...        S         0
1048       3               Nakid, Miss. Maria ("Mary")  ...        C         1
1098       3                Palsson, Miss. Stina Viola  ...        S         0
1099       3             Palsson, Miss. Torborg Danira  ...        S         0
1112       3                 Peacock, Miss. Treasteall  ...        S         0
1156       3               Rosblom, Miss. Salli Helena  ...        S         0
1187       3           Sandstrom, Miss. Beatrice Irene  ...        S         1
1189       3           Sandstrom, Miss. Marguerite Rut  ...        S         1
1208       3                        Skoog, Miss. Mabel  ...        S         0
1209       3             Skoog, Miss. Margit Elizabeth  ...        S         0
1230       3                Strom, Miss. Telma Matilda  ...        S         0
1257       3                Touma, Miss. Maria Youssef  ...        C         1
1265       3                 Van Impe, Miss. Catharina  ...        S         0

[41 rows x 11 columns]

##### Data Cleaning

In [0]:
# Import a new  dataset
df = pd.read_csv("https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv")

UnicodeDecodeError: ignored

You will **always** encounter such errors. You can find their solution just by googling the exact error. Often you will find a stackoverflow link like this addresessing your problem.

https://stackoverflow.com/questions/30462807/encoding-error-in-panda-read-csv

In [0]:
df = pd.read_csv("https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv", encoding='latin1')

In [0]:
df.head()

    ano      mes estado   numero  encontro
0  1998  Janeiro   Acre  0 Fires  1/1/1998
1  1999  Janeiro   Acre  0 Fires  1/1/1999
2  2000  Janeiro   Acre  0 Fires  1/1/2000
3  2001  Janeiro   Acre  0 Fires  1/1/2001
4  2002  Janeiro   Acre  0 Fires  1/1/2002

In [0]:
# Renaming columns 
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}

df.rename(columns = new_columns, inplace=True)

In [0]:
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre         0 Fires  1/1/1998
1  1999  Janeiro  Acre         0 Fires  1/1/1999
2  2000  Janeiro  Acre         0 Fires  1/1/2000
3  2001  Janeiro  Acre         0 Fires  1/1/2001
4  2002  Janeiro  Acre         0 Fires  1/1/2002

In [0]:
# Find unique states
df['state'].unique()

array(['Acre', 'alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'parÃ¡', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

In [0]:
# Re-arranging columns
new_order = [4,1,0,2,3]
df = df[df.columns[new_order]]

In [0]:
df.head()

       date    month  year state number_of_fires
0  1/1/1998  Janeiro  1998  Acre         0 Fires
1  1/1/1999  Janeiro  1999  Acre         0 Fires
2  1/1/2000  Janeiro  2000  Acre         0 Fires
3  1/1/2001  Janeiro  2001  Acre         0 Fires
4  1/1/2002  Janeiro  2002  Acre         0 Fires

In [0]:
# Remove text from columns
df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df.head()

       date    month  year state number_of_fires
0  1/1/1998  Janeiro  1998  Acre               0
1  1/1/1999  Janeiro  1999  Acre               0
2  1/1/2000  Janeiro  2000  Acre               0
3  1/1/2001  Janeiro  2001  Acre               0
4  1/1/2002  Janeiro  2002  Acre               0

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
date               6454 non-null object
month              6454 non-null object
year               6454 non-null int64
state              6454 non-null object
number_of_fires    6322 non-null object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

In [0]:
# We need to convert our number_of_fires column to a float data type
# Also, here's an alternative string manipulation technique we can use

df["number_of_fires"] = df["number_of_fires"].str.replace('','0').astype(float)
df.head()

       date    month  year state  number_of_fires
0  1/1/1998  Janeiro  1998  Acre              0.0
1  1/1/1999  Janeiro  1999  Acre              0.0
2  1/1/2000  Janeiro  2000  Acre              0.0
3  1/1/2001  Janeiro  2001  Acre              0.0
4  1/1/2002  Janeiro  2002  Acre              0.0

In [0]:
df.isnull().sum()

date                 0
month                0
year                 0
state                0
number_of_fires    132
dtype: int64

##### Handling missing data

In [0]:
# We can easily remove Null or NaN (not a number) values 

# Drop rows with NaN values
df = df.dropna() 
df = df.reset_index() # reset's row indexes in case any rows were dropped
df.head()

   index      date    month  year state  number_of_fires
0      0  1/1/1998  Janeiro  1998  Acre              0.0
1      1  1/1/1999  Janeiro  1999  Acre              0.0
2      2  1/1/2000  Janeiro  2000  Acre              0.0
3      3  1/1/2001  Janeiro  2001  Acre              0.0
4      4  1/1/2002  Janeiro  2002  Acre              0.0

In [0]:
df.isnull().sum()

index              0
date               0
month              0
year               0
state              0
number_of_fires    0
dtype: int64

Lets looks at other ways to handle missing data

In [0]:
# Let's reload our dataframe
file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}
df.rename(columns = new_columns, inplace=True)
df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df_copy = df.copy()
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [0]:
df[df['number_of_fires'].isnull()].head(10)

     year     month    state number_of_fires      date
68   2006     Abril     Acre             NaN  1/1/2006
110  2008     Junho     Acre             NaN  1/1/2008
127  2005     Julho     Acre             NaN  1/1/2005
206  2004  Novembro     Acre             NaN  1/1/2004
217  2015  Novembro     Acre             NaN  1/1/2015
444  2002  Novembro  alagoas             NaN  1/1/2002
522  2001     MarÃ§o    Amapa             NaN  1/1/2001
550  2009     Abril    Amapa             NaN  1/1/2009
614  2013     Julho    Amapa             NaN  1/1/2013
642  2001  Setembro    Amapa             NaN  1/1/2001

You can either 
1. remove rows with missing data
2. fill the missing data with average
3. replace with zeros, forward fill or backfill

In [0]:
# Drop rows with NaN/ Null values

df.dropna()

      year     month      state number_of_fires      date
0     1998   Janeiro       Acre               0  1/1/1998
1     1999   Janeiro       Acre               0  1/1/1999
2     2000   Janeiro       Acre               0  1/1/2000
3     2001   Janeiro       Acre               0  1/1/2001
4     2002   Janeiro       Acre               0  1/1/2002
...    ...       ...        ...             ...       ...
6449  2012  Dezembro  Tocantins             128  1/1/2012
6450  2013  Dezembro  Tocantins              85  1/1/2013
6451  2014  Dezembro  Tocantins             223  1/1/2014
6452  2015  Dezembro  Tocantins             373  1/1/2015
6453  2016  Dezembro  Tocantins             119  1/1/2016

[6322 rows x 5 columns]

In [0]:
# Fill missing values with zeros
df['number_of_fires'].fillna(0).head()

0    0
1    0
2    0
3    0
4    0
Name: number_of_fires, dtype: object

In [0]:
# Let's try back filling
df['number_of_fires'].fillna(method='ffill').head(70)

0     0
1     0
2     0
3     0
4     0
     ..
65    1
66    2
67    1
68    1
69    0
Name: number_of_fires, Length: 70, dtype: object

In [0]:
df = df_copy

In [0]:
df['number_of_fires'] = df['number_of_fires'].fillna(0)
df.isnull().sum()

year               0
month              0
state              0
number_of_fires    0
date               0
dtype: int64

##### Changing data type of columns

In [0]:
df["number_of_fires"] = df["number_of_fires"].str.replace('','0').astype(float)

In [0]:
df.head()

   year    month state  number_of_fires      date
0  1998  Janeiro  Acre              0.0  1/1/1998
1  1999  Janeiro  Acre              0.0  1/1/1999
2  2000  Janeiro  Acre              0.0  1/1/2000
3  2001  Janeiro  Acre              0.0  1/1/2001
4  2002  Janeiro  Acre              0.0  1/1/2002

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
year               6454 non-null int64
month              6454 non-null object
state              6454 non-null object
number_of_fires    6322 non-null float64
date               6454 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 252.2+ KB

In [0]:
# Let's convert our Portuguese month names to English

month_translations = {'Janeiro': 'January',
'Fevereiro': 'February',
'MarÃ§o': 'March',
'Abril': 'April',
'Maio': 'May',
'Junho': 'June',
'Julho': 'July',
'Agosto': 'August',
'Setembro': 'September',
'Outubro': 'October',
'Novembro': 'November',
'Dezembro': 'December'}

df["month"] = df["month"].map(month_translations)
df.head()

   year month state  number_of_fires
0  1998   NaN  Acre              0.0
1  1999   NaN  Acre              0.0
2  2000   NaN  Acre              0.0
3  2001   NaN  Acre              0.0
4  2002   NaN  Acre              0.0

##### Dropping columns or rows

In [0]:
# Dropping multiple columns
df = df.drop("date", axis=1) # axis = 1 so that it works across our columns
df.head()

   year    month state  number_of_fires
0  1998  January  Acre              0.0
1  1999  January  Acre              0.0
2  2000  January  Acre              0.0
3  2001  January  Acre              0.0
4  2002  January  Acre              0.0

In [0]:
# Drop multiple rows

df = df.drop(df.index[[2,3]])
df.head()

   year month state  number_of_fires
0  1998   NaN  Acre              0.0
1  1999   NaN  Acre              0.0
4  2002   NaN  Acre              0.0
5  2003   NaN  Acre           1000.0
6  2004   NaN  Acre              0.0

In [0]:
# Drop a range of rows

df = df.drop(df.index[1:4])
df.head()

   year month state  number_of_fires
0  1998   NaN  Acre              0.0
6  2004   NaN  Acre              0.0
7  2005   NaN  Acre           1020.0
8  2006   NaN  Acre             40.0
9  2007   NaN  Acre              0.0

##### Data Aggregation

In [0]:
# Let's reload our dataframe
import pandas as pd

file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}
df.rename(columns = new_columns, inplace=True)
df['state'] = df['state'].str.title()

df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df['number_of_fires'] = df['number_of_fires'].fillna(0)
df['number_of_fires'] = df['number_of_fires'].astype(float)


# Renaming the columns
month_translations = {'Janeiro': 'January',
'Fevereiro': 'February',
'MarÃ§o': 'March',
'Abril': 'April',
'Maio': 'May',
'Junho': 'June',
'Julho': 'July',
'Agosto': 'August',
'Setembro': 'September',
'Outubro': 'October',
'Novembro': 'November',
'Dezembro': 'December'}

df["month"] = df["month"].map(month_translations)
df.head(15)

    year    month state  number_of_fires      date
0   1998  January  Acre              0.0  1/1/1998
1   1999  January  Acre              0.0  1/1/1999
2   2000  January  Acre              0.0  1/1/2000
3   2001  January  Acre              0.0  1/1/2001
4   2002  January  Acre              0.0  1/1/2002
5   2003  January  Acre             10.0  1/1/2003
6   2004  January  Acre              0.0  1/1/2004
7   2005  January  Acre             12.0  1/1/2005
8   2006  January  Acre              4.0  1/1/2006
9   2007  January  Acre              0.0  1/1/2007
10  2008  January  Acre              0.0  1/1/2008
11  2009  January  Acre              0.0  1/1/2009
12  2010  January  Acre              1.0  1/1/2010
13  2011  January  Acre              0.0  1/1/2011
14  2012  January  Acre              0.0  1/1/2012

##### **Group by** - very useful data analysis tool in Pandas

In [0]:
group_state = df.groupby('state')
group_state

In [0]:
group_state.mean()

                         year  number_of_fires
state
Acre              2007.460251        75.192594
Alagoas           2007.500000        19.141667
Amapa             2007.460251        84.136301
Amazonas          2007.460251       125.063301
Bahia             2007.460251       181.639962
Ceara             2007.460251       127.175908
Distrito Federal  2007.460251        14.648536
Espirito Santo    2007.460251       154.821238
Goias             2007.460251        97.752519
Maranhao          2007.460251       103.929577
Mato Grosso       2007.460251       199.930910
Minas Gerais      2007.460251       154.821238
Paraiba           2007.460251       108.209033
ParÃ¡              2007.460251        92.569640
Pernambuco        2007.460251        96.062762
Piau              2007.460251       157.082222
Rio               2007.460251        62.482378
Rondonia          2007.460251        80.499703
Roraima           2007.460251        99.368510
Santa Catarina    2007.460251        97.752519
Sao Paulo         2007.460251       208.737230
Sergipe           2007.460251        13.251046
Tocantins         2007.460251       139.922632

In [0]:
pd.DataFrame(df.groupby('state')['number_of_fires'].mean())

                  number_of_fires
state
Acre                    75.192594
Alagoas                 19.141667
Amapa                   84.136301
Amazonas               125.063301
Bahia                  181.639962
Ceara                  127.175908
Distrito Federal        14.648536
Espirito Santo         154.821238
Goias                   97.752519
Maranhao               103.929577
Mato Grosso            199.930910
Minas Gerais           154.821238
Paraiba                108.209033
ParÃ¡                    92.569640
Pernambuco              96.062762
Piau                   157.082222
Rio                     62.482378
Rondonia                80.499703
Roraima                 99.368510
Santa Catarina          97.752519
Sao Paulo              208.737230
Sergipe                 13.251046
Tocantins              139.922632

##### Concatenating, Merging and Joining

In [0]:
# Create two dummy dataframes for understanding
import pandas as pd

df1 = pd.DataFrame({'item': ['A', 'B', 'C', 'D'],
                     'value': [1, 2, 3, 5]})

df2 = pd.DataFrame({'item': ['E', 'F', 'G', 'H'],
                    'value': [5, 6, 7, 8]})

In [0]:
df1

  item  value
0    A      1
1    B      2
2    C      3
3    D      5

In [0]:
df2

  item  value
0    E      5
1    F      6
2    G      7
3    H      8

In [0]:
# Stack them vertically with pd.concat

pd.concat([df1, df2])

  item  value
0    A      1
1    B      2
2    C      3
3    D      5
0    E      5
1    F      6
2    G      7
3    H      8

In [0]:
# Stack them horizontally by axis=1

pd.concat([df1,df2], axis=1)

  item  value item  value
0    A      1    E      5
1    B      2    F      6
2    C      3    G      7
3    D      5    H      8

In [0]:
# By using apend we can add multuple dataframes
df1 = pd.DataFrame({'item': ['A', 'B', 'C', 'D'],
                     'value': [1, 2, 3, 5]})

df2 = pd.DataFrame({'item': ['D', 'F', 'G', 'H'],
                    'quanity': [2, 2, 1, 5]})

df3 = pd.DataFrame({'item': ['I', 'J', 'K', 'L'],
                    'quanity': [3, 4, 7, 25]})

df1.append([df2, df3])

/usr/local/lib/python3.6/dist-packages/pandas/core/frame.py:7138: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

  item  quanity  value
0    A      NaN    1.0
1    B      NaN    2.0
2    C      NaN    3.0
3    D      NaN    5.0
0    D      2.0    NaN
1    F      2.0    NaN
2    G      1.0    NaN
3    H      5.0    NaN
0    I      3.0    NaN
1    J      4.0    NaN
2    K      7.0    NaN
3    L     25.0    NaN

![alt text](https://i.stack.imgur.com/hMKKt.jpg)

In [0]:
dfA = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

dfB = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                       'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']})

In [0]:
dfA

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [0]:
dfB

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [0]:
# By defauly join type is 'inner'
pd.merge(dfA, dfB, on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [0]:
 # Understand the difference between left and right joins
 
dfA = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

dfB = pd.DataFrame({'key': ['K4', 'K1', 'K2', 'K3'],
                       'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']})

In [0]:
dfA

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [0]:
dfB

  key   C   D
0  K4  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [0]:
# Left join
pd.merge(dfA, dfB, how='left', on='key')

  key   A   B    C    D
0  K0  A0  B0  NaN  NaN
1  K1  A1  B1   C1   D1
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [0]:
# inner join
pd.merge(dfA, dfB, how='inner', on='key')

  key   A   B   C   D
0  K1  A1  B1  C1  D1
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [0]:
# Outer Joins

pd.merge(dfA, dfB, how='outer', on='key')

  key    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1   C1   D1
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K4  NaN  NaN   C0   D0

# **SQL - Structured Query Language**

SQL and Python integration in Jupyter notebooks

Will show you how to connect python and sql in jupyter environement, syntax can be learned from links

In [0]:
import sqlite3
conn = sqlite3.connect('titanic.db')

In [0]:
df.to_sql('table1', con = conn, index=False, if_exists='replace')

In [0]:
def run_query(query):
    return pd.read_sql(query,conn)

In [0]:
run_query('SELECT * FROM table1 LIMIT 10')

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0
5       1                              Anderson, Mr. Harry  ...        S         1
6       1                Andrews, Miss. Kornelia Theodosia  ...        S         1
7       1                           Andrews, Mr. Thomas Jr  ...        S         0
8       1    Appleton, Mrs. Edward Dale (Charlotte Lamson)  ...        S         1
9       1                          Artagaveytia, Mr. Ramon  ...        C         0

[10 rows x 11 columns]

In [0]:
# To display all passengers whose name start from B
run_query('SELECT name, sex, age FROM table1 WHERE name LIKE "B%";')

                                                name     sex   age
0                       Barber, Miss. Ellen "Nellie"  female  26.0
1               Barkworth, Mr. Algernon Henry Wilson    male  80.0
2                                Baumann, Mr. John D    male   NaN
3                           Baxter, Mr. Quigg Edmond    male  24.0
4    Baxter, Mrs. James (Helene DeLaudeniere Chaput)  female  50.0
..                                               ...     ...   ...
98                   Brocklebank, Mr. William Alfred    male  35.0
99                          Buckley, Miss. Katherine  female  18.5
100                              Buckley, Mr. Daniel    male  21.0
101                              Burke, Mr. Jeremiah    male  19.0
102                          Burns, Miss. Mary Delia  female  18.0

[103 rows x 3 columns]

Best place to learn SQL: 

https://www.w3schools.com/sql/

Best place to practice SQL: 

https://sqlzoo.net/wiki/SQL_Tutorial

Link to my project:

https://github.com/hsay95/Movie-Database---Tweepy-and-SQL-lite/blob/master/DMDD%20-%20Assignment%202%20-%20Tweepy%20API.ipynb